In [40]:
import sqlite3

In [41]:
## Connect to SQLite data base
connection=sqlite3.connect('example.db')
connection

In [42]:
cursor=connection.cursor()

In [44]:
## Create a Table
cursor.execute('''
Create Table If Not Exists employees(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department text
    )
''')

## Commit the changes
connection.commit()

In [45]:

cursor.execute('''
Select * from employees
''')

connection.commit()

In [48]:
##Insert the data into sqlite lable
cursor.execute('''
Insert INTO employees(name,age,department)               
            Values('Bob',25,'Engineering')
''')

cursor.execute('''
Insert INTO employees(name,age,department)               
            Values('Hari',31,'Data Science')
''')            

cursor.execute('''
Insert INTO employees(name,age,department)               
            Values('Bistto',30,'Graphic Designer')
''')               

connection.commit()

In [49]:
##Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

##Print the Querified data

for row in rows:
    print(row)

(4, 'Hari', 34, 'Data Science')
(5, 'Bistto', 30, 'Graphic Designer')
(7, 'Hari', 34, 'Data Science')
(8, 'Bistto', 30, 'Graphic Designer')
(10, 'Hari', 34, 'Data Science')
(11, 'Bistto', 30, 'Graphic Designer')
(13, 'Hari', 34, 'Data Science')
(14, 'Bistto', 30, 'Graphic Designer')
(15, 'Bob', 25, 'Engineering')
(16, 'Hari', 31, 'Data Science')
(17, 'Bistto', 30, 'Graphic Designer')
(18, 'Bob', 25, 'Engineering')
(19, 'Hari', 31, 'Data Science')
(20, 'Bistto', 30, 'Graphic Designer')

In [37]:
cursor.execute('''
UPDATE employees
Set age=34
Where name="Hari"              
''')

In [50]:
## Delete the data from the table
cursor.execute('''
Delete from employees
Where name='Bob'
''')

connection.commit()

In [51]:
cursor.execute('Select * from employees')
rows=cursor.fetchall()

for row in rows:
    print(row)

(4, 'Hari', 34, 'Data Science')
(5, 'Bistto', 30, 'Graphic Designer')
(7, 'Hari', 34, 'Data Science')
(8, 'Bistto', 30, 'Graphic Designer')
(10, 'Hari', 34, 'Data Science')
(11, 'Bistto', 30, 'Graphic Designer')
(13, 'Hari', 34, 'Data Science')
(14, 'Bistto', 30, 'Graphic Designer')
(16, 'Hari', 31, 'Data Science')
(17, 'Bistto', 30, 'Graphic Designer')
(19, 'Hari', 31, 'Data Science')
(20, 'Bistto', 30, 'Graphic Designer')

In [61]:
## Working with sales data
connection=sqlite3.connect('sales_data.db')
cursor=connection.cursor()

#Create a table for sales data

cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
''')

##INSET DATA INTO IT
sales_data=[
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

cursor.executemany('''
Insert into sales(date,product,sales,region)     
                   values(?,?,?,?)              
''',sales_data)

connection.commit()

In [62]:
cursor.execute('SELECT * FROM sales')
rows=cursor.fetchall()

for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [63]:
##Close the connection
connection.close()

In [64]:
cursor.execute('SELECT * FROM sales')
rows=cursor.fetchall()

for row in rows:
    print(row)

ProgrammingError: Cannot operate on a closed database.